Задачи на позицию Intern Python Developer.

1. Сравнивает два числа A и B после деления на N и округления вверх. Выводит "Yes", если A больше B, иначе "No".

2. Программа, которая принимает ввод от пользователя в виде трех символов (">", "=", или "<") и удаляет из списка возможных перестановок те, которые не соответствуют введенным условиям.

3. Программа, которая считает количество нулей в числе N, исключая завершающие нули.

4. Программа генерирует двумерный массив размерности n*n, где каждый элемент является буквой алфавита, исходя из его позиции. Элементы выбираются по специальному правилу, зависящему от расстояния до диагоналей матрицы.
 
5. Программа, которая вычисляет количество перестановок из чисел от 1 до N, сумма которых, умноженная на соответствующее число перестановки, делится на k без остатка.

6. Программа, которая вычисляет количество комбинаций из чисел, введенных пользователем, размера k, в которых все числа упорядочены в убывающем порядке. Количество таких комбинаций выводится по модулю 10^9 + 7.
